rails5_login_app/app/views/users/show.html.erb

<!-- @user.itemsに変更 -->
<% @user.items.each do |item| %>
---
SELECT `items`.* FROM `items` WHERE `items`.`user_id` = 1