csv_qiita2_2/app/controllers/users_controller.rb

  def create
    User.create(user_params)
---
INSERT INTO `users` (`name`, `age`, `created_at`, `updated_at`) VALUES ('tanaka', 43, '2020-03-23 22:12:01', '2020-03-23 22:12:01')

  def destroy
    user = User.find(params[:id])
    user.delete
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 8 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 8

  def update
    user = User.find(params[:id])
    user.update(user_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1
UPDATE `users` SET `name` = 'yam', `updated_at` = '2020-03-20 02:25:01' WHERE `users`.`id` = 6