index_kinou/app/controllers/users_controller.rb

  def create
    User.create(user_params)
---
INSERT INTO `users` (`name`, `created_at`, `updated_at`) VALUES ('saito', '2020-03-16 14:57:55', '2020-03-16 14:57:55')