csv2/app/models/user.rb

  def self.import(file)
    CSV.foreach(file.path, headers: true) do |row|
      user = find_by(id: row["id"]) || new
      user.attributes = row.to_hash.slice(*updatable_attributes)
      user.save!
---
INSERT INTO `users` (`name`, `age`, `created_at`, `updated_at`) VALUES ('yoshiki', 50, '2020-03-29 05:57:46', '2020-03-29 05:57:46')