rails5_crud_app_resources/app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `age`, `created_at`, `updated_at`) VALUES ('tanaka', 38, '2020-04-20 06:39:53', '2020-04-20 06:39:53')
---
  def create
   User.create(user_params)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 2
---
  def destroy
    user = User.find(params[:id])
    user.delete

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1
UPDATE `users` SET `name` = '内da', `age` = 18, `updated_at` = '2020-04-20 07:35:38' WHERE `users`.`id` = 6
---
  def update
    user = User.find(params[:id])
    user.update(user_params)