redirect_to_kinou/app/controllers/users_controller.rb

  def create
    User.create(user_params)
---
INSERT INTO `users` (`name`, `created_at`, `updated_at`) VALUES ('aaaaaaa', '2020-03-21 01:27:21', '2020-03-21 01:27:21')

  def destroy
    user = User.find(params[:id])
    user.delete
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 2

  def update
    user = User.find(params[:id])
    user.update(user_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `name` = '田', `updated_at` = '2020-03-21 04:30:43' WHERE `users`.`id` = 2