create_kinou/app/controllers/users_controller.rb

  def create
    User.create(user_params)
---
INSERT INTO `users` (`name`, `created_at`, `updated_at`) VALUES ('yamada', '2020-03-15 03:11:29', '2020-03-15 03:11:29')