rails5_login_app/app/controllers/items_controller.rb

  def create
    Item.create(name: item_params[:name], price: item_params[:price], user_id: current_user.id)
---
INSERT INTO `items` (`name`, `price`, `user_id`, `created_at`, `updated_at`) VALUES ('肉まｎ', 5000, 1, '2020-04-18 13:11:30', '2020-04-18 13:11:30')