rails5_login_app/app/controllers/users_controller.rb

  def show
     @user = User.find(current_user.id)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1