csv1/app/models/user.rb

INSERT INTO `users` (`created_at`, `updated_at`, `name`, `age`) VALUES ('2020-03-28 11:17:01', '2020-03-28 11:17:01', 'yoshiki', 50)
---
  def self.import(file)
    CSV.foreach(file.path, headers: true) do |row|
      # IDが見つかれば、レコードを呼び出し、見つかれなければ、新しく作成
      user = find_by(id: row["id"]) || new
      # CSVからデータを取得し、設定する
      user.attributes = row.to_hash.slice(*updatable_attributes)
      # 保存する
      user.save!