destroy_kinou/app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `created_at`, `updated_at`) VALUES ('tanaka', '2020-03-19 16:21:18', '2020-03-19 16:21:18')
---
  def create
    User.create(user_params)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 0 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 1
---
  def destroy
    user = User.find(params[:id])
    user.delete