show_kinou/app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `created_at`, `updated_at`) VALUES ('saito', '2020-03-20 00:28:33', '2020-03-20 00:28:33')
---
  def create
    User.create(user_params)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 1
---
  def destroy
    user = User.find(params[:id])
    user.delete

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1
UPDATE `users` SET `name` = 'yam', `updated_at` = '2020-03-20 02:25:01' WHERE `users`.`id` = 6
---
  def update
    user = User.find(params[:id])
    user.update(user_params)